[{
    "name":"Day 1",
    "text":"● The instructional delivery follows a gradual release model (I do, We do, You Do).\n \n● During the \"I do\" part, the introduction of the importance of typing skills will be supported by Canva slides.\n● Students will watch a series of slides emphasizing the importance of typing skills, common letters, and functions of the different keys. Throughout this part, students will participate by answering questions and engaging in collaborative learning.\n \n● During the \"We do\" part, the whole class will practice logging into Typetastic. Step-by-step guidance on how to log in to the app will be provided, followed by 5 minutes for students to explore the app. Questions will be answered, and monitoring will take place during this time.\n \n● During the \"You do\" part, students will complete level one on Typetastic, which provides immediate feedback. The teacher will check for correct finger positioning and letter accuracy.\n\n● To conclude the lesson for day 1, students will complete a worksheet with a picture of the keyboard containing missing keys, and they will fill in the missing ones."
},
{
    "name":"Day 2",
    "text":"● The instructional delivery will continue to follow the gradual release model (I do, We do, You Do).\n\n● During the \"I do\" part, a review from the previous day's slides will be conducted, including different depth of knowledge questions to check for understanding and goal attainment.\n\n● During the \"We do\" part, the whole class will log into Pear Deck, an interactive presentation allowing real-time monitoring of student activities. For example, students will be asked to type the sentence: \"My name is Paula Valencia\" to check for proper capitalization. There will also be a series of questions requiring students to apply the functions of different keys and type sentences correctly.\n\n● During the \"You do\" part, students will log back into the Typetastic app. Small groups of students (at least 6 at a time) will be called to the teacher's table, prearranged based on their abilities. During this time, students will be directed to position their fingers on the correct keys, demonstrating proper hand positioning. Immediate feedback will be provided, and students will be assessed.\n\n● To conclude the lesson for day 2, all students will be assessed, data will be recorded, and adjustments will be made as needed."
}]